app/Filters/AuthFilter.php

     public function before(RequestInterface $request, $arguments = null)
     {
         $session = session();
         $currentUri = $request->uri->getPath();

         // 🚨 Permet à `/auth/logout` sans restriction
         if ($currentUri === 'auth/logout') {
             return;
         }

         // 📥 Vérifie si l'utilisateur est connecté
         if ($session->get('user_id')) {
             $userModel = new Users();
             $userId = $session->get('user_id');
             $currentUser = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'