app/Controllers/BaseController.php

    protected function autoRefuseReservations()
    {
        // Vérifier si la fonction a été exécutée récemment pour éviter un traitement excessif
        $lastExecution = $this->getLastExecution();

        if ($lastExecution && time() - strtotime($lastExecution) < 24 * 60 * 60) {
            return; // La fonction a été exécutée récemment, pas besoin de la réexécuter
        }

        // Mettre à jour la dernière heure d'exécution de la fonction
        $this->updateLastExecution();

        // Continuer avec la logique pour refuser automatiquement les réservations
        $reservationModel = new Reservation();

        $limitDate = date('Y-m-d H:i:s', strtotime('-24 hours'));

        $reservationsToRefuse = $reservationModel->where('status', 0)
            ->where('date_reservation <', $limitDate)
            ->findAll();
---
SELECT *
FROM `reservation`
WHERE `status` = 0
AND `date_reservation` < '2024-12-23 10:38:33'