app/Models/Auteur.php

public function getTotalAuteurs()
{

    return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `auteur`