app/Models/Emprunt.php

SELECT `emprunt`.*, `users`.`nom`, `users`.`prenom`, `users`.`civilite`, `users`.`role`, `users`.`matricule`, `livre`.`nom_livre`
FROM `emprunt`
JOIN `users` ON `users`.`id` = `emprunt`.`user_id`
JOIN `livre` ON `livre`.`id` = `emprunt`.`id_livre`
ORDER BY `emprunt`.`date_emprunt` ASC
---
    public function getEmprunts($userId = null, $role)
    {
        // Si l'utilisateur est un administrateur, retourne tous les emprunts
        if ($role === 'ADMINISTRATEUR') {
            return $this->select('emprunt.*, users.nom, users.prenom, users.civilite, users.role, users.matricule, livre.nom_livre')
                        ->join('users', 'users.id = emprunt.user_id')
                        ->join('livre', 'livre.id = emprunt.id_livre')
                        ->orderBy('emprunt.date_emprunt', 'ASC')
                        ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `emprunt`
WHERE `user_id` IS NULL
AND `retour_status` = 0
SELECT COUNT(*) AS `numrows`
FROM `emprunt`
WHERE `user_id` IS NULL
AND `retour_status` = 1
---
public function getTotalEmpruntsByStatus()
{
    // Récupérer l'ID de l'utilisateur connecté
    $userId = session()->get('id');

    // Exécuter la requête pour compter les réservations avec status 0 de l'utilisateur connecté
    $countStatus0 = $this->where('user_id', $userId)->where('retour_status', 0)->countAllResults();

    // Exécuter la requête pour compter les réservations avec status 1 de l'utilisateur connecté
    $countStatus1 = $this->where('user_id', $userId)->where('retour_status', 1)->countAllResults();