app/Models/Livre.php

    public function getQteStock($id)
    {
        $qte_emprunt = $this->db->table('emprunt')
            ->where('id_livre', $id)
            ->where('retour_status', 0)
            ->countAllResults();

        $qte_stock = $this->find($id)->quantite - $qte_emprunt;
---
SELECT COUNT(*) AS `numrows`
FROM `emprunt`
WHERE `id_livre` = '1'
AND `retour_status` = 0
SELECT *
FROM `livre`
WHERE `livre`.`id` = '1'

    public function getLivresBetweenDates($start_date, $end_date)
{
    // Exécutez la requête pour obtenir les derniers livres
    $query = $this->db->table('livre')
        ->select('livre.id, livre.nom_livre, livre.nbre_page, livre.isbn, livre.quantite, livre.fichier_livre, livre.created_at, DATE_FORMAT(livre.created_at, "%d/%m/%Y à %H:%i") AS ajoute_le, auteur.libelle AS nom_auteur, categorie.libelle AS nom_categorie, ranger.libelle AS nom_ranger, casier.libelle AS nom_casier')
        ->join('auteur', 'auteur.id = livre.id_auteur', 'left')
        ->join('categorie', 'categorie.id = livre.id_categorie', 'left')
        ->join('casier', 'casier.id = livre.id_casier', 'left')
        ->join('ranger', 'ranger.id = livre.id_ranger', 'left')
        ->where('DATE_FORMAT(livre.created_at, "%Y-%m-%d") >=', $start_date)
        ->where('DATE_FORMAT(livre.created_at, "%Y-%m-%d") <=', $end_date)
        ->orderBy('livre.created_at', 'ASC')
        ->get();
---
SELECT `livre`.`id`, `livre`.`nom_livre`, `livre`.`nbre_page`, `livre`.`isbn`, `livre`.`quantite`, `livre`.`fichier_livre`, `livre`.`created_at`, DATE_FORMAT(livre.created_at, "%d/%m/%Y à %H:%i") AS ajoute_le, `auteur`.`libelle` AS `nom_auteur`, `categorie`.`libelle` AS `nom_categorie`, `ranger`.`libelle` AS `nom_ranger`, `casier`.`libelle` AS `nom_casier`
FROM `livre`
LEFT JOIN `auteur` ON `auteur`.`id` = `livre`.`id_auteur`
LEFT JOIN `categorie` ON `categorie`.`id` = `livre`.`id_categorie`
LEFT JOIN `casier` ON `casier`.`id` = `livre`.`id_casier`
LEFT JOIN `ranger` ON `ranger`.`id` = `livre`.`id_ranger`
WHERE DATE_FORMAT(livre.created_at, "%Y-%m-%d") >= '2020-01-01'
AND DATE_FORMAT(livre.created_at, "%Y-%m-%d") <= '2024-12-24'
ORDER BY `livre`.`created_at` ASC