app/Models/Memoire.php

SELECT COUNT(*) AS `numrows` FROM `memoire`
---
    public function getTotalMemoires()
    {

        return $this->countAll();