app/Models/Notification.php

    public function getUserNotifications($userId)
    {
        return $this->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `notification`
WHERE `user_id` IS NULL
ORDER BY `created_at` DESC