app/Models/Reservation.php

SELECT `reservation`.*, `livre`.`nom_livre`, `livre`.`quantite`, `livre`.`id_auteur`, `auteur`.`libelle` AS `nom_auteur`, `users`.`nom`, `users`.`matricule`, `users`.`prenom`, `users`.`civilite`, `users`.`role`
FROM `reservation`
JOIN `livre` ON `livre`.`id` = `reservation`.`id_livre`
JOIN `users` ON `users`.`id` = `reservation`.`user_id`
JOIN `auteur` ON `auteur`.`id` = `livre`.`id_auteur`
ORDER BY `reservation`.`date_reservation` ASC
---
    public function getReservations($userId = null)
    {
        $query = $this->select('reservation.*, livre.nom_livre, livre.quantite, livre.id_auteur, auteur.libelle AS nom_auteur, users.nom, users.matricule, users.prenom, users.civilite, users.role')
            ->join('livre', 'livre.id = reservation.id_livre')
            ->join('users', 'users.id = reservation.user_id')
            ->join('auteur', 'auteur.id = livre.id_auteur');

        // Si un ID utilisateur est fourni et que l'utilisateur n'est pas administrateur, ajoutez une condition WHERE pour filtrer par ID utilisateur
        if ($userId !== null && session()->get('role') !== 'ADMINISTRATEUR') {
            $role = session()->get('role');
            if ($role === 'ETUDIANT' || $role === 'PROFESSEUR') {
                $query->where('reservation.user_id', $userId);
            }
        }

        // Exécutez la requête et retournez les résultats triés par date
        $reservations = $query->orderBy('reservation.date_reservation', 'ASC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `reservation`
WHERE `user_id` IS NULL
AND `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `reservation`
WHERE `user_id` IS NULL
AND `status` = 1
---
    public function getTotalReservationsByStatus()
    {
        // Récupérer l'ID de l'utilisateur connecté
        $userId = session()->get('id');

        // Exécuter la requête pour compter les réservations avec status 0 de l'utilisateur connecté
        $countStatus0 = $this->where('user_id', $userId)->where('status', 0)->countAllResults();

        // Exécuter la requête pour compter les réservations avec status 1 de l'utilisateur connecté
        $countStatus1 = $this->where('user_id', $userId)->where('status', 1)->countAllResults();

SELECT `reservation`.*, `livre`.`nom_livre`, `livre`.`id_auteur`, `auteur`.`libelle` AS `nom_auteur`, `users`.`nom`, `users`.`matricule`, `users`.`prenom`, `users`.`civilite`
FROM `reservation`
JOIN `users` ON `users`.`id` = `reservation`.`user_id`
JOIN `livre` ON `livre`.`id` = `reservation`.`id_livre`
JOIN `auteur` ON `auteur`.`id` = `livre`.`id_auteur`
WHERE `reservation`.`user_id` = '2'
AND `users`.`role` = 'ADMINISTRATEUR'
ORDER BY `reservation`.`date_reservation` DESC
 LIMIT 5
---
    public function getLastReservationsByRole($user_id, $role)
{
    $reservations = $this->select('reservation.*, livre.nom_livre, livre.id_auteur, auteur.libelle AS nom_auteur, users.nom, users.matricule, users.prenom, users.civilite')
        ->join('users', 'users.id = reservation.user_id')
        ->join('livre', 'livre.id = reservation.id_livre')
        ->join('auteur', 'auteur.id = livre.id_auteur')
        ->where('reservation.user_id', $user_id)
        ->where('users.role', $role)
        ->orderBy('reservation.date_reservation', 'DESC')
        ->limit(5)
        ->get()
        ->getResult();

SELECT `reservation`.`id`, `reservation`.`user_id`, `reservation`.`id_livre`, `auteur`.`libelle` AS `nom_auteur`, `reservation`.`date_reservation`, `reservation`.`status`, `reservation`.`date_status`, DATE_FORMAT(reservation.created_at, '%d/%m/%Y \à %H:%i') as ajoute_le, `u`.`nom`, `u`.`prenom`, `u`.`role`, `u`.`matricule`, `u`.`civilite`, `l`.`nom_livre`, `l`.`id_auteur`, `l`.`quantite`, `l`.`nom_livre`, `l`.`isbn`, `l`.`id_ranger`, `l`.`id_casier`, `l`.`nbre_page`
FROM `reservation`
JOIN `users` `u` ON `reservation`.`user_id` = `u`.`id`
JOIN `livre` `l` ON `reservation`.`id_livre` = `l`.`id`
JOIN `auteur` ON `auteur`.`id` = `l`.`id_auteur`
WHERE DATE_FORMAT(reservation.created_at,'%Y-%m-%d') BETWEEN '2024-04-29' AND '2025-01-05'
ORDER BY `reservation`.`date_reservation` ASC
---
    public function getReservationsBetweenDates($start_date, $end_date, $date_filter_chosen_label)
    {
        $builder = $this->db->table('reservation');
        $builder->select("reservation.id, reservation.user_id, reservation.id_livre, auteur.libelle AS nom_auteur, reservation.date_reservation, reservation.status, reservation.date_status, DATE_FORMAT(reservation.created_at, '%d/%m/%Y \à %H:%i') as ajoute_le, u.nom, u.prenom, u.role, u.matricule, u.civilite, l.nom_livre, l.id_auteur, l.quantite, l.nom_livre, l.isbn, l.id_ranger, l.id_casier, l.nbre_page")
            ->join('users u', 'reservation.user_id = u.id')
            ->join('livre l', 'reservation.id_livre = l.id')
            ->join('auteur', 'auteur.id = l.id_auteur')
            ->orderBy('reservation.date_reservation', 'ASC');

        if (session()->get('role') == 'ADMINISTRATEUR') {
            $builder->where("DATE_FORMAT(reservation.created_at,'%Y-%m-%d') BETWEEN '" . $start_date . "' AND '" . $end_date . "'");
        } elseif (in_array(session()->get('role'), ['ETUDIANT', 'PROFESSEUR'])) {
            $builder->where("DATE_FORMAT(reservation.created_at,'%Y-%m-%d') BETWEEN '" . $start_date . "' AND '" . $end_date . "' AND reservation.user_id = '" . session()->get('id') . "'");
        }
        // executer le query
        $query = $builder->get();