app/Models/Users.php

    public function getUsersByRoles($roles = [])
    {
        // Utilisez `whereIn` pour vérifier plusieurs rôles
        return $this->whereIn('role', array_map('strtoupper', $roles))->findAll();
---
SELECT *
FROM `users`
WHERE `role` IN ('ADMINISTRATEUR','INVITE')

    public function getLastUsersByRole($role = 'ETUDIANT')
    {
        if ($role !== 'ETUDIANT' && $role !== 'PROFESSEUR') {
            return [];  // Retourne un tableau vide si le rôle n'est pas correct
        }

        $query = $this->db->table('users')
            ->select('users.id, users.matricule, users.initials, users.nom, users.prenom, users.civilite, users.email, cycle.libelle AS nom_cycle, filiere.libelle AS nom_filiere')
            ->join('cycle', 'cycle.id = users.id_cycle', 'left')
            ->join('filiere', 'filiere.id = users.id_filiere', 'left')
            ->where('users.role', $role)
            ->orderBy('users.id', 'DESC')
            ->limit(5)
            ->get();
---
SELECT `users`.`id`, `users`.`matricule`, `users`.`initials`, `users`.`nom`, `users`.`prenom`, `users`.`civilite`, `users`.`email`, `cycle`.`libelle` AS `nom_cycle`, `filiere`.`libelle` AS `nom_filiere`
FROM `users`
LEFT JOIN `cycle` ON `cycle`.`id` = `users`.`id_cycle`
LEFT JOIN `filiere` ON `filiere`.`id` = `users`.`id_filiere`
WHERE `users`.`role` = 'ETUDIANT'
ORDER BY `users`.`id` DESC
 LIMIT 5

    public function getTotalUsersByRole()
    {
        // Exécuter une requête pour compter le nombre total d'étudiants et de professeurs
        $totalStudents = $this->where('role', 'ETUDIANT')->countAllResults();
        $totalTeachers = $this->where('role', 'PROFESSEUR')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'ETUDIANT'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'PROFESSEUR'

    public function getStudentStatByCycle()
    {
        // Requête pour récupérer le nombre d'étudiants inscrits par cycle
        $query = $this->db->table('users')
            ->select('cycle.libelle AS cycle, COUNT(*) AS number')
            ->join('cycle', 'cycle.id = users.id_cycle')
            ->where('users.role', 'ETUDIANT')
            ->groupBy('users.id_cycle')
            ->get();
---
SELECT `cycle`.`libelle` AS `cycle`, COUNT(*) AS number
FROM `users`
JOIN `cycle` ON `cycle`.`id` = `users`.`id_cycle`
WHERE `users`.`role` = 'ETUDIANT'
GROUP BY `users`.`id_cycle`