app/Models/Visite.php

    public function getVisitesBetweenDates($start_date, $end_date)
    {
        $builder = $this->db->table('visite v');
        $builder->select('v.id, cycle.libelle AS nom_cycle, filiere.libelle AS nom_filiere, v.motifVisite_id, mv.libelle, v.date_debut, v.date_fin, v.status, v.user_id, u.nom, u.prenom, u.role, u.civilite, u.matricule,
                      DATE_FORMAT(v.created_at, "%d/%m/%Y à %H:%i") AS ajoute_le')
            ->join('users u', 'v.user_id = u.id')
            ->join('cycle', 'cycle.id = u.id_cycle', 'left')
            ->join('filiere', 'filiere.id = u.id_filiere', 'left')
            ->join('motifvisite mv', 'v.motifVisite_id = mv.id');

        if (session()->get('role') == 'ADMINISTRATEUR') {
            $builder->where("DATE_FORMAT(v.created_at,'%Y-%m-%d') BETWEEN '" . $start_date . "' AND '" . $end_date . "'");
        } elseif (in_array(session()->get('role'), ['ETUDIANT', 'PROFESSEUR'])) {
            $builder->where("DATE_FORMAT(v.created_at,'%Y-%m-%d') BETWEEN '" . $start_date . "' AND '" . $end_date . "' AND v.user_id = '" . session()->get('id') . "'");
        }

        $query = $builder->get();
---
SELECT `v`.`id`, `cycle`.`libelle` AS `nom_cycle`, `filiere`.`libelle` AS `nom_filiere`, `v`.`motifVisite_id`, `mv`.`libelle`, `v`.`date_debut`, `v`.`date_fin`, `v`.`status`, `v`.`user_id`, `u`.`nom`, `u`.`prenom`, `u`.`role`, `u`.`civilite`, `u`.`matricule`, DATE_FORMAT(v.created_at, "%d/%m/%Y à %H:%i") AS ajoute_le
FROM `visite` `v`
JOIN `users` `u` ON `v`.`user_id` = `u`.`id`
LEFT JOIN `cycle` ON `cycle`.`id` = `u`.`id_cycle`
LEFT JOIN `filiere` ON `filiere`.`id` = `u`.`id_filiere`
JOIN `motifvisite` `mv` ON `v`.`motifVisite_id` = `mv`.`id`
WHERE DATE_FORMAT(v.created_at,'%Y-%m-%d') BETWEEN '2020-01-01' AND '2024-12-24'

    public function getMostVisitedStudentAndRepeatedFiliere($start_date, $end_date)
{
    $builder = $this->db->table('visite v');
    $builder->select('v.user_id, u.nom, u.prenom, COUNT(v.id) AS visite_count, u.matricule, u.role, u.id_cycle, cy.libelle AS nom_cycle, u.id_filiere, f.libelle AS nom_filiere')
        ->join('users u', 'v.user_id = u.id')
        ->join('filiere f', 'u.id_filiere = f.id')
        ->join('cycle cy', 'u.id_cycle = cy.id')
        ->where('v.status', 'terminee')
        ->where('u.role', 'ETUDIANT')
        ->where("DATE_FORMAT(v.created_at,'%Y-%m-%d') BETWEEN '" . $start_date . "' AND '" . $end_date . "'")
        ->groupBy('v.user_id')
        ->limit(3);

    $builder->orderBy('visite_count', 'DESC');
    $query = $builder->get();
---
SELECT `v`.`user_id`, `u`.`nom`, `u`.`prenom`, COUNT(v.id) AS visite_count, `u`.`matricule`, `u`.`role`, `u`.`id_cycle`, `cy`.`libelle` AS `nom_cycle`, `u`.`id_filiere`, `f`.`libelle` AS `nom_filiere`
FROM `visite` `v`
JOIN `users` `u` ON `v`.`user_id` = `u`.`id`
JOIN `filiere` `f` ON `u`.`id_filiere` = `f`.`id`
JOIN `cycle` `cy` ON `u`.`id_cycle` = `cy`.`id`
WHERE `v`.`status` = 'terminee'
AND `u`.`role` = 'ETUDIANT'
AND DATE_FORMAT(v.created_at,'%Y-%m-%d') BETWEEN '2020-01-01' AND '2024-12-24'
GROUP BY `v`.`user_id`
ORDER BY `visite_count` DESC
 LIMIT 3

public function getMostVisitedCycleAndFiliere($start_date, $end_date)
{
    $builder = $this->db->table('visite v');
    $builder->select('u.id_cycle, cy.libelle AS nom_cycle, u.id_filiere, f.libelle AS nom_filiere, COUNT(v.id) AS visite_count')
        ->join('users u', 'v.user_id = u.id')
        ->join('filiere f', 'u.id_filiere = f.id')
        ->join('cycle cy', 'u.id_cycle = cy.id')
        ->where('v.status', 'terminee')
        ->where('u.role', 'ETUDIANT')
        ->where("DATE_FORMAT(v.created_at,'%Y-%m-%d') BETWEEN '" . $start_date . "' AND '" . $end_date . "'")
        ->groupBy('u.id_cycle, u.id_filiere')
        ->orderBy('visite_count', 'DESC')
        ->limit(3);

    $query = $builder->get();
---
SELECT `u`.`id_cycle`, `cy`.`libelle` AS `nom_cycle`, `u`.`id_filiere`, `f`.`libelle` AS `nom_filiere`, COUNT(v.id) AS visite_count
FROM `visite` `v`
JOIN `users` `u` ON `v`.`user_id` = `u`.`id`
JOIN `filiere` `f` ON `u`.`id_filiere` = `f`.`id`
JOIN `cycle` `cy` ON `u`.`id_cycle` = `cy`.`id`
WHERE `v`.`status` = 'terminee'
AND `u`.`role` = 'ETUDIANT'
AND DATE_FORMAT(v.created_at,'%Y-%m-%d') BETWEEN '2020-01-01' AND '2024-12-24'
GROUP BY `u`.`id_cycle`, `u`.`id_filiere`
ORDER BY `visite_count` DESC
 LIMIT 3